# PlumbingFixturesDrain Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PlumbingFixturesDrain Property
ParameterTypeId Class See Also
---
"Drain"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PlumbingFixturesDrain { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PlumbingFixturesDrain As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PlumbingFixturesDrain {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace